Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
	int start = _current_task + 1;
	if (start >= SCHEDULER_IDLE_TASK_INDEX) {
		start = 0;
	}

	for (int n = 0; n < SCHEDULER_IDLE_TASK_INDEX; n++) {
		int i = start + n;
		if (i >= SCHEDULER_IDLE_TASK_INDEX) {
			i -= SCHEDULER_IDLE_TASK_INDEX;
		}

		if (_tasks[i].state == TaskReady) {
			if (_tasks[i].priority < best_prio) {
				best_prio = _tasks[i].priority;
				best = i;
			}
		}
	}

	if (best < 0) {
		best = SCHEDULER_IDLE_TASK_INDEX;
	}

	if (_scheduler_running) {

		// Record stat data
		uint32_t now = DWT->CYCCNT;
		int prev = _current_task;
		_Task_Stats_TypeDef *previous_stats = &_task_stats[prev];

		uint32_t raw = now - previous_stats->last_start_cycle;
		uint32_t isr_part = _task_isr_cycles[prev];
		_task_isr_cycles[prev] = 0;
		uint32_t active = (raw > isr_part) ? (raw - isr_part) : 0;

		previous_stats->total_cycles += active;

		if (best != prev) {
			// Min, Max
			if (active < previous_stats->min_cycles) previous_stats->min_cycles = active;
			if (active > previous_stats->max_cycles) previous_stats->max_cycles = active;

			if (_tasks[prev].state == TaskReady && prev != SCHEDULER_IDLE_TASK_INDEX) {
				previous_stats->total_preempts++;
			}

			_Task_Stats_TypeDef *next_stats = &_task_stats[best];
			next_stats->last_start_cycle = now;
			next_stats->total_invocations++;
		} else {
			previous_stats->last_start_cycle = now;
		}
	}

	return best;
}

// -------------------------------------------------------------------------
// PSPLIM computation
// -------------------------------------------------------------------------

static void _compute_psplim(int slot) {
	uint32_t bytes = _task_stack_sizes[slot] * 4;
	uint32_t guard = bytes / 4;
	if (guard < 64) guard = 64;
	if (guard > 512) guard = 512;

	uint32_t psp_limit = (uint32_t)_task_stack_bases[slot] + guard + SCHEDULER_EXCEPTION_FRAME_BYTES;
	uint32_t stack_end = (uint32_t)_task_stack_bases[slot] + bytes;

	if (psp_limit > stack_end - _STACK_FRAME_WORDS * 4) {
		psp_limit = stack_end - _STACK_FRAME_WORDS * 4;
	}
	if (psp_limit < (uint32_t)_task_stack_bases[slot]) {
		psp_limit = (uint32_t)_task_stack_bases[slot];
	}

	_task_psplims[slot] = psp_limit;
}

// -------------------------------------------------------------------------
// Context switch - SVC (first-task bootstrap)
// -------------------------------------------------------------------------

/**
 * @brief SVC handler - bootstrap the first task and start the tick timer
 */
__attribute__((naked)) void SVC_Handler(void){
	__asm volatile (
		"ldr    r0, =_current_task                  \n"
		"ldr    r3, [r0]                            \n"

		"ldr    r2, =_tasks                         \n"
		"mov    r1, #" _STR(_TCB_SIZE) "             \n"
		"mul    r0, r3, r1                          \n"
		"add    r2, r2, r0                          \n"

		"ldr    r0, =_task_psplims                  \n"
		"lsl    r1, r3, #2                          \n"
		"ldr    r0, [r0, r1]                        \n"
		"msr    psplim, r0                          \n"
		"isb                                        \n"

		"ldr    r0, [r2, #" _STR(_TCB_SAVED_SP) "]    \n"
		"ldmia  r0!, {r4-r11}                       \n"
		"msr    psp, r0                             \n"
		"isb                                        \n"

		"movs   r0, #2                              \n"
		"msr    control, r0                         \n"
		"isb                                        \n"

		// Start TIM7 now that PSP and CONTROL are valid
		"push {r0, lr}                              \n"
		"bl SCHEDULER_StartTick                     \n"
		"pop {r0, lr}                               \n"

		"ldr    lr, =0xFFFFFFFD                     \n"
		"bx     lr                                  \n"
	);
}

// -------------------------------------------------------------------------
// Context switch - PendSV (preemptive)
// -------------------------------------------------------------------------

/**
 * @brief PendSV handler - preemptive context switch
 */
__attribute__((naked)) void PendSV_Handler(void){
	__asm volatile (
		"cpsid	i\n"

		"mrs	r0, psp\n"
		"stmdb	r0!, {r4-r11}\n"

		"tst	lr, #0x10\n"
		"it		eq\n"
		"vstmdbeq r0!, {s16-s31}\n"

		"ldr	r2, =_current_task\n"
		"ldr	r3, [r2]\n"
		"ldr	r4, =_tasks\n"

		"mov	r5, #" _STR(_TCB_SIZE) "\n"
		"mul	r3, r3, r5\n"
		"add	r4, r4, r3\n"
		"str	r0, [r4, #" _STR(_TCB_SAVED_SP) "]\n"
		"str	lr, [r4, #" _STR(_TCB_EXC_RETURN) "]\n"

		"push	{r1, lr}\n"
		"bl		SCHEDULER_SelectNextTask\n"
		"pop	{r1, lr}\n"

		"ldr	r2, =_current_task\n"
		"str	r0, [r2]\n"

		"ldr	r4, =_tasks\n"
		"mov	r5, #" _STR(_TCB_SIZE) "\n"
		"mul	r0, r0, r5\n"
		"add	r4, r4, r0\n"

		"1:\n"
		"ldr	r0, =_task_psplims\n"
		"ldr	r2, =_current_task\n"
		"ldr	r3, [r2]\n"
		"lsl	r3, r3, #2\n"
		"ldr	r0, [r0, r3]\n"
		"msr	psplim, r0\n"
		"isb\n"

		"ldr	r0, [r4, #" _STR(_TCB_SAVED_SP) "]\n"
		"ldr	lr, [r4, #" _STR(_TCB_EXC_RETURN) "]\n"

		"tst	lr, #0x10\n"
		"it		eq\n"
		"vldmiaeq r0!, {s16-s31}\n"

		"ldmia	r0!, {r4-r11}\n"
		"msr	psp, r0\n"

		"cpsie	i\n"
		"bx		lr\n"
	);
}

// -------------------------------------------------------------------------
// Tick source
// -------------------------------------------------------------------------

/**
 * @brief Start the TIM7 tick timer and enable its interrupt
 */
void SCHEDULER_StartTick(void){
	NVIC_ClearPendingIRQ(TIM7_IRQn);
	NVIC_EnableIRQ(TIM7_IRQn);
	TIMER_Start(TIM7);
	_scheduler_running = 1;
}

// -------------------------------------------------------------------------
// Scheduler statistics
// -------------------------------------------------------------------------

static uint32_t _last_print_tick = 0;
static uint32_t _last_stats_tick = 0;

void SCHEDULER_ISR_enter(void){
	if (_isr_nest == 0) {
		_isr_entry_cycle = DWT->CYCCNT;
		_isr_owner_task = _current_task;
	}
	_isr_nest++;
}

void SCHEDULER_ISR_exit(void){
	_isr_nest--;
	if (_isr_nest == 0) {
		uint32_t isr_cycles = DWT->CYCCNT - _isr_entry_cycle;
		_isr_total_cycles += isr_cycles;
		if (_isr_owner_task >= 0 && _isr_owner_task < SCHEDULER_MAX_TASKS) {
			_task_isr_cycles[_isr_owner_task] += isr_cycles;
		}
	}
}

static void SCHEDULER_PrintStats(void){
	__disable_irq();

	uint32_t total = 0;

	// Snapshot struct
	struct {
		uint32_t cycles;
		uint32_t min_cycles;
		uint32_t max_cycles;
		uint32_t preempts;
		uint32_t invocs;
		const char* name;
	} snap[SCHEDULER_MAX_TASKS];
	int snap_n = 0;

